import React, { Component } from 'react';
import '../../../components-styles/Content.css';

class Content extends Component {
	componentDidMount() {
		this.setupHobbyClickEvent();
	}

	setupHobbyClickEvent() {
		const firstHobby = document.getElementById("first-hobby");
		const secondHobby = document.getElementById("second-hobby");

		firstHobby.onclick = () => {
			this.toggleHobbyClass(firstHobby);
		};

		secondHobby.onclick = () => {
			this.toggleHobbyClass(secondHobby);
		};
	}


	toggleHobbyClass(element) {
		if (element.className === "orange") {
			element.className = "lime";
		} else {
			element.className = "orange";
		}
	}

	render() {
		return (
			<div>
				<p>
					Місце народження: 25 січня, 2004 року, м.Рівне
				</p>
				<ul>
					<li>
						<p>НТУУ "КПІ", м.Київ</p>
					</li>
					<li>
						<p>Обласний науковий ліцей, м.Рівне</p>
					</li>
				</ul>
				<p>Хобі</p>
				<ul>
					<li id="first-hobby">Спорт</li>
					<li id="second-hobby">Комп'ютерні ігри</li>
					<li>Заварювання кави</li>
				</ul>

				<p>Улюблені фільми</p>
				<ol>
					<li>The Hateful Eight</li>
					<li>Django Unchained</li>
					<li>Inglourious Basterds</li>
					<li>1+1</li>
					<li>Shutter Island</li>
				</ol>

				<p>Рівне місто в Україні, обласний центр Рівненської області, центр Рівненського району і Рівненської громади.
					Машинобудування, хімічна (ПАТ «Рівне-Азот»), легка, харчова промисловість, торфова промисловість. Три виші, два
					театри. Історико-краєзнавчий музей. Успенська дерев'яна церква (XVIII ст.).

					Відоме з 1283 року (за уточненими даними з 1434 року). Магдебурзьке право з 1492 року. Перша письмова згадка про
					Рівне у статусі міста — 1496 рік, у Волинському короткому літописі.</p>

				<p>У 1340 році, майже на два століття, місто у складі Волині переходить до складу Великого князівство Литовського,
					Руського, Жемантійського. Адміністративна територія Волині була поділена на три староства.</p>

				<p>У 1569 році за Люблінською унією Рівне підпорядковується Луцькому повіту. Знищення міста татарами, спалення церкви
					та костелу.</p>
				<p>23 квітня (4 травня) 1793 внаслідок другого Речі Посполитої Рівне переходить до Російської імперії, а до міста
					входять російські війська під командуванням М. Кречетнікова. 29 серпня (9 вересня) 1793 року Рівне набуває статусу
					повітового центру в складі новоутвореного Волинського намісництва (з 1797 року — губернії)</p>
				<p>1914 року починається Перша світова війна та мобілізація чоловічого населення Рівного.</p>
				<p>У 1922 році польська влада дає дозвіл на відновлення діяльності Рівненської повітової «Просвіти».</p>
			</div>
		);
	}
}

export default Content;